#+TITLE: MTCG
:FILE-OPTIONS:
#+STARTUP: fold
#+OPTIONS: toc:nil
#+OPTIONS: num:2
#+OPTIONS: \n:t
#+LATEX_HEADER: \usepackage{helvet}
#+LATEX_HEADER: \renewcommand{\familydefault}{\sfdefault}
#+LATEX_HEADER: \usepackage{nopageno}
#+LATEX_HEADER: \setlength{\parindent}{0pt}
#+LATEX_HEADER: \usepackage[a4paper, margin=2.5cm]{geometry}
:END:

* PROJ [[file:./mtcg.pdf][Monster Card Game]]
DEADLINE: <2023-02-26 Sun 23:55>
:info:
Checklist:
(async-shell-command "chromium https://docs.google.com/spreadsheets/d/1QpgEEVFwCxaCE-Q3iN1O-8myCMOjknp8/edit#gid=231551220")
:end:
** TODO Database [4/4]
:LOGBOOK:
CLOCK: [2023-02-06 Mon 17:13]--[2023-02-06 Mon 18:37] =>  1:24
CLOCK: [2023-02-05 Sun 18:14]--[2023-02-05 Sun 19:49] =>  1:35
CLOCK: [2023-02-05 Sun 15:00]--[2023-02-05 Sun 18:00] =>  3:00
:END:
+ [X] Set up the docker containers
  - [X] postgres
  - [X] adminer
+ [X] Find out how to connect to the database in code
+ [X] Find out how to write prepared statements
  - [X] Prevent SQL injection
    + Using methods such as =setString(foo)= neutralizes the sql injection
      threat by turning even dangerous input into a simple string
  - [X] Take advantage of autocloseable functionality
    + Always use the try-with-resources pattern, taking advantage of the static =HikariDataSource=
+ [X] Create Schema
  - This happens 'automatically' as a result of using create table statements in
    the repositories
** TODO Controllers [2/4]
:LOGBOOK:
CLOCK: [2023-02-22 Wed 20:41]--[2023-02-22 Wed 22:02] =>  1:21
CLOCK: [2023-02-22 Wed 19:56]--[2023-02-22 Wed 20:25] =>  0:29
CLOCK: [2023-02-22 Wed 17:46]--[2023-02-22 Wed 19:23] =>  1:37
CLOCK: [2023-02-22 Wed 15:45]--[2023-02-22 Wed 16:50] =>  1:05
CLOCK: [2023-02-21 Tue 16:04]--[2023-02-21 Tue 18:46] =>  2:42
CLOCK: [2023-02-21 Tue 14:42]--[2023-02-21 Tue 15:56] =>  1:14
CLOCK: [2023-02-21 Tue 08:34]--[2023-02-21 Tue 12:01] =>  3:27
CLOCK: [2023-02-19 Sun 23:00]--[2023-02-19 Sun 23:37] =>  0:37
CLOCK: [2023-02-19 Sun 19:10]--[2023-02-19 Sun 21:19] =>  2:09
CLOCK: [2023-02-19 Sun 18:14]--[2023-02-19 Sun 18:42] =>  0:28
CLOCK: [2023-02-19 Sun 17:38]--[2023-02-19 Sun 18:05] =>  0:27
CLOCK: [2023-02-19 Sun 16:30]--[2023-02-19 Sun 17:21] =>  0:51
CLOCK: [2023-02-19 Sun 13:10]--[2023-02-19 Sun 16:00] =>  2:50
CLOCK: [2023-02-19 Sun 11:38]--[2023-02-19 Sun 12:35] =>  0:57
CLOCK: [2023-02-18 Sat 17:28]--[2023-02-18 Sat 19:56] =>  2:28
CLOCK: [2023-02-18 Sat 16:31]--[2023-02-18 Sat 17:11] =>  0:40
CLOCK: [2023-02-18 Sat 16:10]--[2023-02-18 Sat 16:18] =>  0:08
CLOCK: [2023-02-18 Sat 12:37]--[2023-02-18 Sat 13:59] =>  1:22
CLOCK: [2023-02-18 Sat 11:00]--[2023-02-18 Sat 12:10] =>  1:10
CLOCK: [2023-02-12 Sun 15:57]--[2023-02-12 Sun 16:15] =>  0:18
CLOCK: [2023-02-12 Sun 10:54]--[2023-02-12 Sun 12:14] =>  1:20
CLOCK: [2023-02-12 Sun 10:17]--[2023-02-12 Sun 10:46] =>  0:29
CLOCK: [2023-02-11 Sat 17:53]--[2023-02-11 Sat 22:00] =>  4:07
:END:
+ [X] UserController [4/4]
  - [X] POST /users
    + [X] Unit test
  - [X] GET /users/{username}
    + [X] Unit test
  - [X] PUT /users/{username} 
    + [X] Unit test
  - [X] POST /sessions
    + [X] Unit test
+ [X] CardsController [5/5]
  - [X] GET /cards
    + [X] Unit test
  - [X] GET /deck
    + [X] Unit test
  - [X] PUT /deck
    + [X] Unit test
  - [X] POST /packages
    + [X] Unit test
  - [X] POST /transactions/packages
    + [X] Unit test
+ [X] TradingController [4/4]
  - [X] GET /tradings
    + [ ] Unit test
  - [X] POST /tradings
    + [ ] Unit test
  - [X] DELETE /tradings/{tradingdealid}
    + [ ] Unit test
  - [X] POST /tradings/{tradingdealid}
    + [ ] Unit test
+ [ ] GameController [2/3]
  - [X] GET /stats
    + [ ] Unit test
  - [X] GET /scoreboard
    + [ ] Unit test
  - [ ] POST /battles
    + [ ] Unit test
** TODO Services [3/4]
+ [X] UserService
+ [X] CardsService
+ [X] TradingService
+ [ ] GameService
** TODO Repositories [3/4]
+ [X] UserRepository
+ [X] CardsRepository
+ [X] TradingRepository
+ [ ] GameRepository
** TODO Model [4/4]
+ [X] UserModel
+ [X] CardsModel
+ [X] TradingModel
+ [X] GameModel
** TODO Synchronization [0/2]
:info:
https://stackoverflow.com/a/2120409
:end:
+ [ ] Identify critical areas
  - should this happen in the services?
+ [ ] Use synchronized keyword
** DONE Learn to use Unit Tests [1/1]
CLOSED: [2023-02-18 Sat 14:03]
:LOGBOOK:
CLOCK: [2023-02-19 Sun 17:25]--[2023-02-19 Sun 17:33] =>  0:08
CLOCK: [2023-02-19 Sun 11:07]--[2023-02-19 Sun 11:38] =>  0:31
CLOCK: [2023-02-12 Sun 15:50]--[2023-02-12 Sun 15:56] =>  0:06
CLOCK: [2023-02-11 Sat 10:09]--[2023-02-11 Sat 13:15] =>  3:06
CLOCK: [2023-02-06 Mon 18:37]--[2023-02-06 Mon 18:56] =>  0:19
:END:
+ [X] Find out how to use mocking
